#include <stdio.h>
int main () {
int lavel; // ตัวเเปลเก็บค่าระดับ
printf("กรุณาป้อนค่าระดับ (1-4): "); // รับค่าตัวเเปล lavel
scanf("%d", &lavel); //อ้านค่าตัวเเปล lavel
switch (lavel)  // ตรวจสอบค่าระดับ
{
case 1: 
    printf("ระดับเงิน\n"); //กรณ๊ระดับเป็นที่ 1
    break;
case 2:
    printf("ระดับทอง\n"); //กรณ๊ระดับเป็นที่ 2
    break; 
case 3:
    printf("ระดับแพลทินัม\n"); //กรณ๊ระดับเป็นที่ 3
    break;
case 4:
    printf("ระดับเพชร\n"); //กรณ๊ระดับเป็นที่ 4
    break;
default:
    break;
}
if (lavel == 1) {
    printf(" ส่วนลด 5%%\n"); //กรณ๊ระดับเป็นที่ 1
}
else if (lavel == 2) {
    printf("ส่วนลด 10%% + คะแนนสะสม\n"); //กรณ๊ระดับเป็นที่ 2
}
else if (lavel == 3) {
    printf(" ส่วนลด 15%% + คะแนนสะสม + ของขวัญ\n"); //กรณ๊ระดับเป็นที่ 3
}  
else if (lavel == 4) {
    printf("ได้ครบทุกอย่าง + กิจกรรม VIP\n"); //กรณ๊ระดับเป็นที่ 4
}
else if (lavel < 1 || lavel > 4) {
    printf("ระดับไม่ถูกต้อง\n"); //กรณ๊ระดับไม่ถูกต้อง
} //ความแตกต่างระหว่าง if กับ switch-case คือ switch สามารถตรวจสอบคเงื่อนไขซับซ้อนได้มากกว่า if 
//เเต่ if สามารถตรวจสอบเงื่อนไขที่เป็นจริงเท่านั้น

return 0;
}
