#include <stdio.h>
int main () {
int lavel; // ตัวเเปลเก็บค่าระดับ
printf("กรุณาป้อนค่าระดับ (1-4): "); // รับค่าตัวเเปล lavel
scanf("%d", &lavel); //อ้านค่าตัวเเปล lavel
// ใช้ if-else ตรวจสอบค่าระดับ
if (lavel == 1){
    printf("ระดับเงิน\n"); //กรณ๊ระดับเป็นที่ 1
}
else if (lavel == 2) {
    printf("ระดับทอง\n"); //กรณ๊ระดับเป็นที่ 2
}
else if (lavel == 3) {
    printf("ระดับแพลทินัม\n"); //กรณ๊ระดับเป็นที่ 3
}
else if (lavel == 4) {
    printf("ระดับเพชร\n"); //กรณ๊ระดับเป็นที่ 4
}
else {
    printf("ระดับสมาชิกไม่ถูกต้อง\n"); //กรณ๊ระดับไม่ถูกต้อง
}

// ใช้ if-else ตรวจสอบค่าระดับ
if (lavel == 1) {
    printf(" ส่วนลด 5%%\n"); //กรณ๊ระดับเป็นที่ 1 
}
else if (lavel == 2) {
    printf("ส่วนลด 10%% + คะแนนสะสม\n"); //กรณ๊ระดับเป็นที่ 2
}
else if (lavel == 3) {
    printf(" ส่วนลด 15%% + คะแนนสะสม + ของขวัญ\n"); //กรณ๊ระดับเป็นที่ 3
}  
else if (lavel == 4) {
    printf("ได้ครบทุกอย่าง + กิจกรรม VIP\n"); //กรณ๊ระดับเป็นที่ 4
}

return 0;
} 