#include <stdio.h>
int main() {
    int lavel; // ตัวเเปลเก็บค่าระดับคะแนน
    printf("กรุณาป้อนค่าระดับคะแนน (1-4): ");
    scanf("%d", &lavel);
    switch (lavel)  { // ตรวจสอบค่าระดับคะแนน
    case 1:
        printf("ระดับคะแนน: ดีมาก\n"); //กรณ๊ระดับคะแนนเป็นที่ 1
        break;
    case 2:
        printf("ระดับคะแนน: ดี\n"); //กรณ๊ระดับคะแนนเป็นที่ 2
        break;
    case 3:
        printf("ระดับคะแนน: พอใช้\n"); //กรณ๊ระดับคะแนนเป็นที่ 3
        break;
    case 4:
        printf("ระดับคะแนน: ปรับปรุง\n"); //กรณ๊ระดับคะแนนเป็นที่ 4
        break;
    default:
        printf("ระดับคะแนนไม่ถูกต้อง\n"); //กรณ๊ระดับคะแนนไม่ถูกต้อง
        break; // break ทำงานภายใน case ส่วน default ทำงานเมื่อไม่มี case ใดๆ ตรงกับค่าที่ตรวจสอบ
    }
    return 0;
}