#include <stdio.h>
int main () {
int lavel; // ตัวเเปลเก็บค่าระดับ
printf("กรุณาป้อนค่าระดับ (1-4): "); // รับค่าตัวเเปล lavel
scanf("%d", &lavel); //อ้านค่าตัวเเปล lavel
switch (lavel)  // ตรวจสอบค่าระดับ
{
case 1: 
    printf("ระดับเงิน\n"); //กรณ๊ระดับเป็นที่ 1
    break;
case 2:
    printf("ระดับทอง\n"); //กรณ๊ระดับเป็นที่ 2
    break; 
case 3:
    printf("ระดับแพลทินัม\n"); //กรณ๊ระดับเป็นที่ 3
    break;
case 4:
    printf("ระดับเพชร\n"); //กรณ๊ระดับเป็นที่ 4
    break;
default:
    printf("ระดับสมาชิกไม่ถูกต้อง\n"); //กรณ๊ระดับไม่ถูกต้อง
    break;
}

 // ใช้ switch-case ตรวจสอบค่าระดับ
switch (lavel) {
case 1:
    printf(" ส่วนลด 5%%\n"); //กรณ๊ระดับเป็นที่ 1 
    break;
case 2:
    printf("ส่วนลด 10%% + คะแนนสะสม\n"); //กรณ๊ระดับเป็นที่ 2
    break;
case 3:
    printf(" ส่วนลด 15%% + คะแนนสะสม + ของขวัญ\n"); //กรณ๊ระดับเป็นที่ 3
    break;
case 4:
    printf("ได้ครบทุกอย่าง + กิจกรรม VIP\n"); //กรณ๊ระดับเป็นที่ 4
    break;

}
return 0;
}
//ความแตกต่างระหว่าง if กับ switch-case คือ switch สามารถตรวจสอบคเงื่อนไขซับซ้อนได้มากกว่า if 
//เเต่ if สามารถตรวจสอบเงื่อนไขที่เป็นจริงเท่านั้น
//เช่น if (x > 10 && y < 20) เป็นต้น
//เเต่ switch สามารถตรวจสอบค่าเดียวเท่านั้น เช่น switch (lavel) เป็นต้น
//นอกจากนี้ switch-case ยังสามารถใช้ร่วมกับ default เพื่อกำหนดค่าที่ไม่ตรงกับ case ใดๆ ได้ด้วย 
//ซึ่ง if-else if-else ไม่สามารถทำได้
//ในกรณีที่มีเงื่อนไขซับซ้อนมากๆ การใช้ switch-case อาจทำให้โค้ดดูง่ายขึ้นและอ่านง่ายขึ้น
//เเต่ถ้าเงื่อนไขไม่ซับซ้อนมาก การใช้ if-else if-else อาจจะเหมาะสมกว่า
//ดังนั้นการเลือกใช้ระหว่าง if กับ switch-case ขึ้นอยู่กับลักษณะของเงื่อนไขที่ต้องการตรวจสอบและความเหมาะสมของโค้ดในแต่ละกรณี
